// 这段代码主要是包含了一些关于版本信息、源代码许可协议、以及一些头文件的定义。注释提供了对代码整体结构和目的的概述。
// Emacs风格的模式选择   -*- C++ -*- 
//-----------------------------------------------------------------------------
//
// $Id:$
//
// 版权所有 (C) 1993-1996 由id Software，Inc.提供。
//
// 本源代码仅在DOOM源代码许可协议规定的条件下可用于分发和/或修改，
// 该协议由id Software发布。保留所有权利。
//
// $Log:$
//
// 描述：
//  DoomDef - DOOM的基本定义，例如版本、游戏模式
//   和技能级别，以及显示参数。
//
//-----------------------------------------------------------------------------

static const char
rcsid[] = "$Id: m_bbox.c,v 1.1 1997/02/03 22:45:10 b1 Exp $";


#ifdef __GNUG__
#pragma implementation "doomdef.h"
#endif
#include "doomdef.h"

// 用于存放任何定义转换为变量的位置。

// 没有。
